[
  {
    "page": 1,
    "text": "In a small Indian village, Aarav watches his sister, Priya, prepare for her wedding. The air is filled with joy and anticipation.",
    "emotional_beat": "Hopeful",
    "visual_scene": "A wide shot of Aarav standing in a dusty village street, with traditional homes and a bustling market in the background, as Priya smiles in a red sari nearby."
  },
  {
    "page": 2,
    "text": "After the wedding, Priya moves to her new home. Aarav notices her smile fading as demands for dowry begin.",
    "emotional_beat": "Concerned",
    "visual_scene": "A medium shot of Aarav peeking through a window, seeing Priya looking downcast in a dimly lit room with traditional decor."
  },
  {
    "page": 3,
    "text": "Aarav hears shouts from next door. He sees Priya's husband yelling, and she flinches. The tension in the house grows.",
    "emotional_beat": "Fearful",
    "visual_scene": "A close-up of Aarav's determined brown eyes, reflecting the scene of domestic tension through a crack in a wooden door."
  },
  {
    "page": 4,
    "text": "One day, Aarav finds Priya crying silently. She whispers about the violence and the pressure for more dowry.",
    "emotional_beat": "Sad",
    "visual_scene": "A medium shot of Aarav kneeling beside Priya, who is seated on a floor mat in a simple room, tears on her cheeks."
  },
  {
    "page": 5,
    "text": "Aarav decides to learn more. He visits the village library, searching for books on women's rights and laws.",
    "emotional_beat": "Determined",
    "visual_scene": "A wide shot of Aarav in a small library with shelves of books, sunlight filtering through a window onto his blue shirt."
  },
  {
    "page": 6,
    "text": "He discovers information about anti-dowry laws and support groups. A poster catches his eye: a local women's group meets weekly.",
    "emotional_beat": "Inspired",
    "visual_scene": "A close-up of Aarav's hand pointing at a poster on a wall, detailing a women's group meeting in muted earth tones."
  },
  {
    "page": 7,
    "text": "Aarav attends the meeting secretly. He listens as women share stories of strength and legal victories against dowry demands.",
    "emotional_beat": "Empowered",
    "visual_scene": "A medium shot of Aarav hiding behind a curtain, peering into a room where women in traditional clothing are gathered."
  },
  {
    "page": 8,
    "text": "He gathers courage and approaches the group leader, Meera. She explains how to file a complaint and seek protection for Priya.",
    "emotional_beat": "Nervous",
    "visual_scene": "A close-up of Aarav speaking to Meera, who wears a simple saree, in a village courtyard with subtle lighting."
  },
  {
    "page": 9,
    "text": "Aarav returns home and tells Priya about the plan. At first, she is afraid, but he reassures her with the knowledge he gained.",
    "emotional_beat": "Supportive",
    "visual_scene": "A medium shot of Aarav and Priya sitting on a doorstep, with Aarav gesturing confidently as Priya listens intently."
  },
  {
    "page": 10,
    "text": "Together, they visit the local police station with Meera. Aarav speaks up, detailing the abuse and dowry demands.",
    "emotional_beat": "Courageous",
    "visual_scene": "A wide shot of Aarav, Priya, and Meera standing before a police officer in a traditional station setting."
  },
  {
    "page": 11,
    "text": "The authorities take action. Priya's husband is warned, and support is arranged. The village begins to talk, spreading awareness.",
    "emotional_beat": "Relieved",
    "visual_scene": "A medium shot of Aarav and Priya walking home, with villagers in the background whispering and looking on."
  },
  {
    "page": 12,
    "text": "Aarav stands tall, knowing his voice made a difference. He vows to continue speaking out, empowering his family and community against injustice.",
    "emotional_beat": "Hopeful",
    "visual_scene": "A close-up of Aarav's thoughtful expression, with the village and setting sun in the background, conveying a sense of resolve."
  }
]